# frozen_string_literal: true

# https://github.com/Homebrew/homebrew-bundle

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "advancecomp"
brew "ansible"
brew "asciidoctor"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "dos2unix"
brew "exa"
brew "fd"
brew "fish"
brew "fontforge"
brew "fonttools"
brew "fzf"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp" # Vim dependency
brew "gnupg" # asdf-nodejs dependency
brew "go"
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "less"
brew "libtermkey"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "mas"
brew "media-info"
brew "memcached"
brew "most"
brew "multitail"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "onefetch"
brew "overmind"
brew "pandoc"
brew "perl"
brew "pgcli"
brew "php@7.4"
brew "php"
brew "brew-php-switcher"
brew "postgresql", restart_service: true
brew "python"
brew "ranger"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unixodbc" # asdf dependency
brew "w3m"
brew "wget"
brew "xz"
brew "zsh"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "brave-browser"
cask "dropbox"
cask "firefox"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono-nerd-font"
cask "google-chrome"
cask "handbrake"
cask "messenger"
cask "micro-snitch"
cask "microsoft-edge"
cask "ngrok"
cask "pdftotext"
cask "pgadmin4"
cask "postico"
cask "postman"
cask "skype"
cask "slack"
cask "tableplus"
cask "toggl-track"
cask "docker"
cask "google-backup-and-sync"
cask "vmware-fusion"
cask "lastpass"
cask "robo-3t"
cask "visual-studio-code"
cask "visual-studio-code"

# vim: set filetype=ruby:
